sysizlayan/Atlas-Haptic/Software/Atlas_haptic_stm32/atlas_haptic/Core/Inc/hw_mpu6050.h
//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_FIFO_COUNTH
// register.
//
//*****************************************************************************
#define MPU6050_FIFO_COUNTH_M   0xFF        // FIFO count [15:8]
#define MPU6050_FIFO_COUNTH_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_FIFO_COUNTL
// register.
//
//*****************************************************************************
#define MPU6050_FIFO_COUNTL_M   0xFF        // FIFO count [7:0]
#define MPU6050_FIFO_COUNTL_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_FIFO_R_W
// register.
//
//*****************************************************************************
#define MPU6050_FIFO_R_W_M      0xFF        // FIFO data
#define MPU6050_FIFO_R_W_S      0

//*****************************************************************************
//
// The following are defines for the bit fields in the MPU6050_O_WHO_AM_I
// register.
//
//*****************************************************************************
#define MPU6050_WHO_AM_I_M      0x75        // I2C address
#define MPU6050_WHO_AM_I_MPU6050                                              \
                                0x68        // MPU6050
#define MPU6050_WHO_AM_I_S      1

#endif // __SENSORLIB_HW_MPU6050_H__
